// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
// Знайти, яке з них є середнім (більше одного, але менше за інше).
// Перевірити, чи знаходиться перше число між двома іншими.

Чому в мене умови з використанням && або || не працюють?

let a = +prompt("Введите число:");
let b = +prompt("Введите число:");
let c = +prompt("Введите число:");

if (a > b && b < c) {
    console.log(b);
} else if (a < b && a > c) {
    console.log(a);
} else if (c < a && c > b){
    console.log(c);
};


// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором

Чому останній рядок не хоче відпрацьовувати?

let ourNum;
let num = +prompt('Введіть число від -100 до 100:');

ourNum =
    (num === 0) ? 'Число дорівнює нулю' :
    (num <= 100) ? 'Число позитивне':
    (num >= 101) ? 'Такого значення немає в заданному диапазоні' :
    (num >= -100) ? 'Число негативне' : 'Такого значення немає в заданному диапазоні';
console.log(ourNum);